/* If a X500 name has a description and a common name we display CommonName (Description) using this format string */
"%@ (%@)" = "%1$@ (%2$@)";

/* Format string used to build a list of values, first argument is list second argument is to be appended element */
"%@, %@" = "%1$@, %2$@";

/* Format string for encoded field data (e.g. Sequence; 128 bytes; data = 00 00 ...) */
"%@; %d %@; data = %@" = "%1$@; %2$d %3$@; данные = %4$@";

/* format string to turn version number into a string */
"%d" = "%d";

/* Value of a field if its length is 0 */
"<NULL>" = "<НУЛЬ>";

/* CRL Distribution Points extension supported reason name */
"AA Compromise" = "Соглашение AA";

/* Label of field in authority info access extension */
"Access Location" = "Местонахождение доступа";

/* Label of field in authority info access extension */
"Access Method" = "Метод доступа";

/* CRL Distribution Points extension supported reason name */
"Affiliation Changed" = "Организация изменилась";

/* Label of the algorithm subfield of an AlgorithmIdentifer */
"Algorithm" = "Алгоритм";

/* Label of field in Authority Key Identifier extension */
"Authority Certificate Serial Number" = "Серийный номер бюро сертификации";

/* Authority info access extension label */
"Authority Information Access" = "Доступ к информации сертификации";

/* Authority Key Identifier extension label */
"Authority Key Identifier" = "Идентификатор ключа органа сертификации";

/* Label used for Basic Constraints when value is invalid */
"Basic Constraints" = "Основные ограничения";

/* First argument to SEC_BLOB_KEY format string for a bit string */
"Bit string" = "Бит-строка";

/* No comment provided by engineer. */
"bits" = "бит";

/* First argument to SEC_BLOB_KEY format string for a Byte string */
"Byte string" = "Байт-строка";

/* Third argument to SEC_BLOB_KEY format string for a byte string */
"bytes" = "байт";

/* CRL Distribution Points extension supported reason name */
"CA Compromise" = "Соглашение органа сертификации";

/* X.509 key usage bitfield name */
"Cert Sign" = "Подпись сертификата";

/* Label for boolean is_ca property of a basic constraints extension */
"Certificate Authority" = "Бюро сертификации";

/* CRL Distribution Points extension supported reason name */
"Certificate Hold" = "Сертификат приостановлен";

/* Certificate Policies extension label */
"Certificate Policies" = "Политики сертификатов";

/* No comment provided by engineer. */
"Certificate Type" = "Тип сертификата";

/* CRL Distribution Points extension supported reason name */
"Cessation Of Operation" = "Прекращение действия";

/* Label of field in Certificate Policies extension */
"CPS URI" = "CPS URI";

/* Label of field in extension that indicates whether this extension is critical */
"Critical" = "Критическое";

/* CRL Distribution Points extension label */
"CRL Distribution Points" = "Точки распределения аннулирования сертификата";

/* Label for CRL issuer field of CRL Distribution Points extension */
"CRL Issuer" = "Эмитент CRL";

/* X.509 key usage bitfield name */
"CRL Sign" = "Подпись CRL";

/* Label for raw data of extension (used for unknown extensions) */
"Data" = "Данные";

/* X.509 key usage bitfield name */
"Data Encipherment" = "Шифрование данных";

/* X.509 key usage bitfield name */
"Decipher Only" = "Только расшифровка";

/* X.509 key usage bitfield name */
"Digital Signature" = "Цифровая подпись";

/* label for general name field value */
"Directory Name" = "Имя каталога";

/* label for general name field value */
"DNS Name" = "Имя DNS";

/* label for general name field value */
"EDI Party Name" = "Имя абонента EDI";

/* label for general name field value */
"Email Address" = "Адрес электронной почты";

/* X.509 key usage bitfield name */
"Encipher Only" = "Только шифрование";

/* No comment provided by engineer. */
"Expired" = "Срок истек";

/* Label of expiration date value when certificate is temporally valid */
"Expires" = "Истекает";

/* Label of field in Certificate Policies extension */
"Explicit Text" = "Ненормативный текст";

/* Extended key usage extension label */
"Extended Key Usage" = "Расширенное использование ключа";

/* Label used for General Name entry when value is invalid */
"General Name" = "Общее имя";

/* Label used for General Names when value is invalid */
"General Names" = "Общие имена";

/* No comment provided by engineer. */
"Hostname mismatch." = "Несовпадение имени хоста.";

/* Label of field in policy constraints extension */
"Inhibit Policy Mapping" = "Блокирование отображения политики";

/* Label of a value is printed into this string if the data is not valid */
"Invalid %@" = "Неверные данные в: %@";

/* No comment provided by engineer. */
"Invalid certificate chain linkage." = "Недействительная связь цепи сертификатов.";

/* label for general name field value */
"IP Address" = "IP-адрес";

/* No comment provided by engineer. */
"Issued By" = "Кем выдан:";

/* No comment provided by engineer. */
"Issuer Name" = "Кем выдан";

/* No comment provided by engineer. */
"Issuer Summary" = "Информация эмитента";

/* No comment provided by engineer. */
"Issuer Unique ID" = "Уникальный идентификатор эмитента";

/* X.509 key usage bitfield name */
"Key Agreement" = "Соглашение о ключах";

/* CRL Distribution Points extension supported reason name */
"Key Compromise" = "Ключевой компромисс";

/* X.509 key usage bitfield name */
"Key Encipherment" = "Шифрование ключа";

/* Label of field in Subject or Authority Key Identifier extension */
"Key Identifier" = "Идентификатор ключа";

/* Subsection label in CRL Distribution Points extension. */
"Name Relative To CRL Issuer" = "Имя, родственное эмитенту CRL";

/* Value for a boolean property when it's value is false (example critical: no) */
"No" = "Нет";

/* X.509 key usage bitfield name */
"Non-Repudiation" = "Неотрекаемость";

/* field value of parameters field when no parameters are present */
"none" = "нет";

/* format string for undisplayed field data with a given DER tag and length */
"not displayed (tag = %@; length %d)" = "не отображено (тег = %1$@; длина %2$d)";

/* label indicating the date after which something is no longer valid */
"Not Valid After" = "Действителен до";

/* label indicating the soonest date at which something is valid */
"Not Valid Before" = "Действителен с";

/* Label of field in Certificate Policies extension */
"Notice Numbers" = "Номера предупреждений";

/* Netscape certificate type usage value */
"Object Signing" = "Подпись объекта";

/* Netscape certificate type usage value */
"Object Signing CA" = "Подпись объекта CA";

/* value of an oid field if it's length is more than what we allow for oids */
"Oid too long" = "Идентификатор объекта слишком длинный";

/* No comment provided by engineer. */
"One or more certificates have expired or are not valid yet." = "Срок действия одного или более сертификатов истек или сертификаты еще не действительны.";

/* No comment provided by engineer. */
"One or more unsupported critical extensions found." = "Найдено как минимум одно неподдерживаемое критически важное расширение.";

/* Label of field in Certificate Policies extension */
"Organization" = "Организация";

/* Label used for Other Name RDN when value is invalid */
"Other Name" = "Другое имя";

/* Label of the parameters subfield of an AlgorithmIdentifer */
"Parameters" = "Параметры";

/* Label for path length constraint property of a basic constraints extension */
"Path Length Constraint" = "Ограничение длины пути";

/* Policy constraints extension label */
"Policy Constraints" = "Ограничения политики";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Identifier #%d" = "Идентификатор политики %d";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Qualifier #%d" = "Квалификатор политики %d";

/* No comment provided by engineer. */
"Policy requirements not met." = "Несоответствие требованиям политики.";

/* Label for an invlaid private key se perion value */
"Private Key Usage Period" = "Период использования личного ключа";

/* CRL Distribution Points extension supported reason name */
"Priviledge Withdrawn" = "Лишение привилегий";

/* No comment provided by engineer. */
"Public Key Algorithm" = "Алгоритм открытого ключа";

/* No comment provided by engineer. */
"Public Key Data" = "Данные открытого ключа";

/* Label of field in extended key usage extension */
"Purpose" = "Цель";

/* Label of field in Certificate Policies extension */
"Qualifier" = "Квалификатор";

/* Label of a RDN */
"RDN" = "RDN";

/* CRL Distribution Points extension supported reasons bitfield label */
"Reasons" = "Причины";

/* label for general name field value */
"Registered ID" = "Зарегистрированный ID";

/* Label of field in policy constraints extension */
"Require Explicit Policy" = "Требовать Explicit Policy";

/* Netscape certificate type usage value */
"Reserved" = "Зарезервированный";

/* No comment provided by engineer. */
"Root certificate is not trusted." = "Корневой сертификат ненадежен.";

/* Netscape certificate type usage value */
"S/MIME" = "S/MIME";

/* Netscape certificate type usage value */
"S/MIME CA" = "S/MIME CA";

/* First argument to SEC_BLOB_KEY format string for a Sequence */
"Sequence" = "Последовательность";

/* No comment provided by engineer. */
"Serial Number" = "Серийный номер";

/* First argument to SEC_BLOB_KEY format string for a Set */
"Set" = "Установить";

/* No comment provided by engineer. */
"Signature" = "Подпись";

/* No comment provided by engineer. */
"Signature Algorithm" = "Алгоритм подписи";

/* Netscape certificate type usage value */
"SSL CA" = "SSL CA";

/* Netscape certificate type usage value */
"SSL client" = "Клиент SSL";

/* Netscape certificate type usage value */
"SSL server" = "Сервер SSL";

/* Subject Key Identifier extension label */
"Subject Key Identifier" = "Субъект";

/* No comment provided by engineer. */
"Subject Name" = "Тема";

/* No comment provided by engineer. */
"Subject Unique ID" = "Уникальный идентификатор субъекта";

/* CRL Distribution Points extension supported reason name */
"Superseded" = "Заменено";

/* No comment provided by engineer. */
"This certificate has an issuer that has expired" = "У сертификата имеется эмитент, срок действия которого истек.";

/* No comment provided by engineer. */
"This certificate has an issuer that is not yet valid" = "У сертификата имеется эмитент, который еще не действителен.";

/* No comment provided by engineer. */
"This certificate has expired" = "Срок действия сертификата истек";

/* No comment provided by engineer. */
"This certificate is not yet valid" = "Сертификат пока не действителен";

/* The certificate is temporally valid */
"This certificate is valid" = "Сертификат действителен";

/* Label of a value is printed into this string if the data can not been parsed according to it's type */
"Unparsed %@" = "Без анализа %@";

/* CRL Distribution Points extension supported reason name */
"Unused" = "Свободный";

/* label for general name field value */
"URI" = "URI";

/* Label for KeyUsage bitfield values */
"Usage" = "Использование";

/* No comment provided by engineer. */
"Valid from" = "Действ. с:";

/* No comment provided by engineer. */
"Version" = "Версия";

/* label for general name field value */
"X.400 Address" = "Адрес X.400";

/* Label of a X.501 Name */
"X.501 Name" = "Имя X.501";

/* No comment provided by engineer. */
"X.509 version %d %scertificate" = "Версия X.509 %1$d сертификата %2$s";

/* Value for a boolean property when it's value is true (example critical: yes) */
"Yes" = "Да";

